# dev-environment Brewfile
# Usage: brew bundle --file=Brewfile

# Data tools
brew "jq"
brew "duckdb"
brew "miller"
brew "gron"
brew "jless"

# Dev essentials
brew "gh"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "tmux"
brew "neovim"
brew "pandoc"
brew "tree"

# Language runtimes
brew "go"
brew "rustup"
brew "node"
brew "bun"
brew "python@3.12"
brew "python@3.13"

# Ruby (via chruby)
brew "chruby"
brew "ruby-install"

# Google Workspace CLI
brew "gws"

# TTS dependency
brew "espeak-ng"

# Beads issue tracker
tap "steveyegge/beads", "https://github.com/steveyegge/homebrew-beads"
brew "bd"

# CASS — Coding Agent Session Search
tap "dicklesworthstone/tap"
brew "cass"

# Docker
cask "docker"
